# GetTextWrap

## Description
Procedure GetTextWrap returns the text wrap mode of the referenced text object.

```pascal
FUNCTION GetTextWrap(theText : HANDLE) : BOOLEAN;
```

```python

def vs.GetTextWrap(theText):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theText|HANDLE|Handle to text object.|

## Version
Availability: from VectorWorks8.0
## Category
* Objects - Text